---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.CurtainSystemBase
source: html/fbe40487-b91b-fc00-3e88-99344591df32.htm
---
# CurtainSystemBase Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.